Revit 2027 API
View.GetWorksetVisibility Method
 Returns the visibility settings of a workset for this particular view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetVisibility GetWorksetVisibility(
	WorksetId worksetId
)
Public Function GetWorksetVisibility (
	worksetId As WorksetId
) As WorksetVisibility
public:
WorksetVisibility GetWorksetVisibility(
	WorksetId^ worksetId
)
member GetWorksetVisibility :
        worksetId : WorksetId -> WorksetVisibility
Parameters
worksetId WorksetId
 Id of the workset.
Return Value
WorksetVisibility
 The visibility of a workset for this particular view.
Exceptions
Exception | Condition
ArgumentException |  There is no workset with this Id in the document associated with this view.
ArgumentNullException |  A non-optional argument was null
Remarks
 The settings does not reflect the fact of whether a workset is currently closed or not.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace